zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_dts.h
/** @brief  Reset DTS handle state
  * @param  __HANDLE__ DTS handle.
  * @retval None
  */
#if (USE_HAL_DTS_REGISTER_CALLBACKS == 1U)
#define __HAL_DTS_RESET_HANDLE_STATE(__HANDLE__) do{                                             \
                                                      (__HANDLE__)->State = HAL_DTS_STATE_RESET; \
                                                      (__HANDLE__)->MspInitCallback = NULL;      \
                                                      (__HANDLE__)->MspDeInitCallback = NULL;    \
                                                    } while(0)
#else /* USE_HAL_DTS_REGISTER_CALLBACKS */
#define __HAL_DTS_RESET_HANDLE_STATE(__HANDLE__) ((__HANDLE__)->State = HAL_DTS_STATE_RESET)
#endif /* USE_HAL_DTS_REGISTER_CALLBACKS */

/**
  * @brief  Enable the specified DTS sensor
  * @param  __HANDLE__ DTS handle.
  * @retval None
  */
#define __HAL_DTS_ENABLE(__HANDLE__) SET_BIT((__HANDLE__)->Instance->CFGR1, DTS_CFGR1_TS1_EN)

/**
  * @brief  Disable the specified DTS sensor
  * @param  __HANDLE__ DTS handle.
  * @retval None
  */
#define __HAL_DTS_DISABLE(__HANDLE__) CLEAR_BIT((__HANDLE__)->Instance->CFGR1, DTS_CFGR1_TS1_EN)

#if defined(CORE_CA7)
/**
  * @brief  Enable the DTS EXTI line in interrupt mode
  * @retval None
  */
#define __HAL_DTS_EXTI_ENABLE_IT() SET_BIT(EXTI_C1->IMR3,DTS_EXTI_LINE_DTS1)

/**
  * @brief  Disable the DTS EXTI line in interrupt mode
  * @retval None
  */
#define __HAL_DTS_EXTI_DISABLE_IT() CLEAR_BIT(EXTI_C1->IMR3,DTS_EXTI_LINE_DTS1)

/**
  * @brief  Enable the DTS EXTI Line in event mode
  * @retval None
  */
#define __HAL_DTS_EXTI_ENABLE_EVENT() SET_BIT(EXTI_C1->EMR3,DTS_EXTI_LINE_DTS1)

/**
  * @brief  Disable the DTS EXTI Line in event mode
  * @retval None
  */
#define __HAL_DTS_EXTI_DISABLE_EVENT() CLEAR_BIT(EXTI_C1->EMR3, DTS_EXTI_LINE_DTS1)

#endif /* CORE_CA7 */

/** @brief  Checks whether the specified DTS flag is set or not.
  * @param  __HANDLE__ specifies the DTS Handle.
  * @param  __FLAG__ specifies the flag to check.
  *        This parameter can be one of the following values:
  *            @arg DTS_FLAG_TS1_ITEF:  Interrupt flag for end of measure for DTS1
  *            @arg DTS_FLAG_TS1_ITLF:  Interrupt flag for low threshold for DTS1
  *            @arg DTS_FLAG_TS1_ITHF:  Interrupt flag for high threshold for DTS1
  *            @arg DTS_FLAG_TS1_AITEF: Asynchronous Interrupt flag for end of measure for DTS1
  *            @arg DTS_FLAG_TS1_AITLF: Asynchronous Interrupt flag for low threshold for DTS1
  *            @arg DTS_FLAG_TS1_AITHF: Asynchronous Interrupt flag for high threshold for DTS1
  *            @arg DTS_FLAG_TS1_RDY:   Ready flag for DTS1
  *            @retval The new state of __FLAG__ (1 or 0).
  */
#define __HAL_DTS_GET_FLAG(__HANDLE__, __FLAG__) \
  (((((__HANDLE__)->Instance->SR &(__FLAG__)) == (__FLAG__)))? 1U : 0U)


/** @brief  Clears the specified DTS pending flag.
  * @param  __HANDLE__ specifies the DTS Handle.
  * @param  __FLAG__ specifies the flag to check.
  *          This parameter can be any combination of the following values:
  *            @arg DTS_CLEAR_TS1_CITEF: Clear Interrupt flag for end of measure for DTS1
  *            @arg DTS_CLEAR_TS1_CITLF: Clear Interrupt flag for low threshold for DTS1
  *            @arg DTS_CLEAR_TS1_CITHF: Clear Interrupt flag for high threshold for DTS1
  *            @arg DTS_CLEAR_TS1_CAITEF: Clear Asynchronous Interrupt flag for end of measure for DTS1
  *            @arg DTS_CLEAR_TS1_CAITLF: Clear Asynchronous Interrupt flag for low threshold for DTS1
  *            @arg DTS_CLEAR_TS1_CAITHF: Clear Asynchronous Interrupt flag for high threshold for DTS1
  * @retval None
  */
#define __HAL_DTS_CLEAR_FLAG(__HANDLE__, __FLAG__) \
  ((__HANDLE__)->Instance->ICIFR  = (__FLAG__))


/** @brief  Enable the specified DTS interrupt.
  * @param  __HANDLE__ specifies the DTS Handle.
  * @param  __INTERRUPT__ specifies the DTS interrupt source to enable.
  *          This parameter can be one of the following values:
  *            @arg DTS_IT_TS1_ITEEN : interrupt flag for end of measure for DTS1
  *            @arg DTS_IT_TS1_ITLEN : interrupt flag for low of measure for DTS1
  *            @arg DTS_IT_TS1_ITHEN : interrupt flag for high of measure for DTS1
  *            @arg DTS_IT_TS1_AITEEN : asynchronous interrupt flag for end of measure for DTS1
  *            @arg DTS_IT_TS1_AITLEN : asynchronous interrupt flag for low of measure for DTS1
  *            @arg DTS_IT_TS1_AITHEN : asynchronous interrupt flag for high of measure for DTS1
  * @retval None
  */
#define __HAL_DTS_ENABLE_IT(__HANDLE__, __INTERRUPT__) \
  SET_BIT((__HANDLE__)->Instance->ITENR, __INTERRUPT__)


/** @brief  Disable the specified DTS interrupt.
  * @param  __HANDLE__ specifies the DTS Handle.
  * @param  __INTERRUPT__ specifies the DTS interrupt source to enable.
  *          This parameter can be one of the following values:
  *            @arg DTS_IT_TS1_ITEEN : interrupt flag for end of measure for DTS1
  *            @arg DTS_IT_TS1_ITLEN : interrupt flag for low of measure for DTS1
  *            @arg DTS_IT_TS1_ITHEN : interrupt flag for high of measure for DTS1
  *            @arg DTS_IT_TS1_AITEEN : asynchronous interrupt flag for end of measure for DTS1
  *            @arg DTS_IT_TS1_AITLEN : asynchronous interrupt flag for low of measure for DTS1
  *            @arg DTS_IT_TS1_AITHEN : asynchronous interrupt flag for high of measure for DTS1
  * @retval None
  */
#define __HAL_DTS_DISABLE_IT(__HANDLE__,__INTERRUPT__) \
  CLEAR_BIT((__HANDLE__)->Instance->ITENR, __INTERRUPT__)


/** @brief  Check whether the specified DTS interrupt source is enabled or not.
  * @param __HANDLE__ DTS handle.
  * @param __INTERRUPT__ DTS interrupt source to check
  *          This parameter can be one of the following values:
  *            @arg DTS_IT_TS1_ITEEN : interrupt flag for end of measure for DTS1
  *            @arg DTS_IT_TS1_ITLEN : interrupt flag for low of measure for DTS1
  *            @arg DTS_IT_TS1_ITHEN : interrupt flag for high of measure for DTS1
  *            @arg DTS_IT_TS1_AITEEN : asynchronous interrupt flag for end of measure for DTS1
  *            @arg DTS_IT_TS1_AITLEN : asynchronous interrupt flag for low of measure for DTS1
  *            @arg DTS_IT_TS1_AITHEN : asynchronous interrupt flag for high of measure for DTS1
  * @retval State of interruption (1 or 0)
  */
#define __HAL_DTS_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__)  \
  ((((__HANDLE__)->Instance->ITENR & (__INTERRUPT__)) == (__INTERRUPT__))? 1U : 0U)


