zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_dts.h
/** @brief  Check whether the specified DTS REFCLK is selected
  * @param __HANDLE__ DTS handle.
  * @param __REFCLK__ DTS reference clock to check
  *          This parameter can be one of the following values:
  * @arg DTS_REFCLKSEL_LSE:   Low speed REF clock
  * @arg DTS_REFCLKSEL_PCLK:  High speed REF clock
  * @retval State of the REF clock tested (1 or 0)
  */
#define __HAL_DTS_GET_REFCLK(__HANDLE__, __REFCLK__) \
  ((((__HANDLE__)->Instance->CFGR1 & (__REFCLK__)) == (__REFCLK__))? 1U : 0U)

/** @brief  Get Trigger
  * @param __HANDLE__ DTS handle.
  * @retval One of the following trigger
  *     DTS_TRIGGER_HW_NONE : No HW trigger (SW trigger)
  *     DTS_TRIGGER_LPTIMER1: LPTIMER1 trigger
  *     DTS_TRIGGER_LPTIMER2: LPTIMER2 trigger
  *     DTS_TRIGGER_LPTIMER3: LPTIMER3 trigger
  *     DTS_TRIGGER_SYSCFG_EXTI13: EXTI13 trigger
  */
#define __HAL_DTS_GET_TRIGGER(__HANDLE__)  ((__HANDLE__)->Instance->CFGR1 & (DTS_CFGR1_TS1_INTRIG_SEL))
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup DTS_Exported_Functions
  * @{
  */

/** @addtogroup DTS_Exported_Functions_Group1
  * @{
  */
/* Initialization and de-initialization functions  **********************************/
HAL_StatusTypeDef HAL_DTS_Init(DTS_HandleTypeDef *hdts);
HAL_StatusTypeDef HAL_DTS_DeInit(DTS_HandleTypeDef *hdts);
void              HAL_DTS_MspInit(DTS_HandleTypeDef *hdts);
void              HAL_DTS_MspDeInit(DTS_HandleTypeDef *hdts);
#if (USE_HAL_DTS_REGISTER_CALLBACKS == 1U)
HAL_StatusTypeDef HAL_DTS_RegisterCallback(DTS_HandleTypeDef        *hdts,
                                           HAL_DTS_CallbackIDTypeDef CallbackID,
                                           pDTS_CallbackTypeDef      pCallback);
HAL_StatusTypeDef HAL_DTS_UnRegisterCallback(DTS_HandleTypeDef        *hdts,
                                             HAL_DTS_CallbackIDTypeDef CallbackID);
#endif /* USE_HAL_DTS_REGISTER_CALLBACKS */
/**
  * @}
  */

/* IO operation functions  *****************************************************/
/** @addtogroup DTS_Exported_Functions_Group2
  * @{
  */
HAL_StatusTypeDef HAL_DTS_Start(DTS_HandleTypeDef *hdts);
HAL_StatusTypeDef HAL_DTS_Stop(DTS_HandleTypeDef *hdts);
HAL_StatusTypeDef HAL_DTS_GetTemperature(DTS_HandleTypeDef *hdts, int32_t *Temperature);
HAL_StatusTypeDef HAL_DTS_Start_IT(DTS_HandleTypeDef *hdts);
HAL_StatusTypeDef HAL_DTS_Stop_IT(DTS_HandleTypeDef *hdts);
void              HAL_DTS_IRQHandler(DTS_HandleTypeDef *hdts);
HAL_DTS_StateTypeDef HAL_DTS_GetState(const DTS_HandleTypeDef *hdts);
/* Callback in Interrupt mode */
void              HAL_DTS_EndCallback(DTS_HandleTypeDef *hdts);
void              HAL_DTS_LowCallback(DTS_HandleTypeDef *hdts);
void              HAL_DTS_HighCallback(DTS_HandleTypeDef *hdts);
void              HAL_DTS_AsyncEndCallback(DTS_HandleTypeDef *hdts);
void              HAL_DTS_AsyncLowCallback(DTS_HandleTypeDef *hdts);
void              HAL_DTS_AsyncHighCallback(DTS_HandleTypeDef *hdts);
/**
  * @}
  */

/* Private types -------------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup DTS_Private_Constants DTS Private Constants
  * @{
  */
/** @defgroup DTS_ExtiLine DTS EXTI Lines
  * @{
  */
#define DTS_EXTI_LINE_DTS1           (EXTI_IMR3_IM72)  /*!< EXTI line 72 connected to DTS1 output */
/**
  * @}
  */

/** @defgroup DTS_IT_Type DTS IT Type
  * @{
  */
#define DTS_IT_ASYNC  (DTS_IT_TS1_AITEEN | DTS_IT_TS1_AITLEN | DTS_IT_TS1_AITHEN) /*!< DTS ASYNC IT */
#define DTS_IT_SYNC   (DTS_IT_TS1_ITEEN | DTS_IT_TS1_ITLEN | DTS_IT_TS1_ITHEN)    /*!< DTS SYNC IT */
/**
  * @}
  */


/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup DTS_Private_Macros DTS Private Macros
  * @{
  */

/** @defgroup DTS_IS_DTS_Definitions  DTS Private macros to check input parameters
  * @{
  */
#define IS_DTS_QUICKMEAS(__SEL__)   (((__SEL__) == DTS_QUICKMEAS_DISABLE) || \
                                     ((__SEL__) == DTS_QUICKMEAS_ENABLE))

#define IS_DTS_REFCLK(__SEL__)      (((__SEL__) == DTS_REFCLKSEL_LSE) || \
                                     ((__SEL__) == DTS_REFCLKSEL_PCLK))


#define IS_DTS_TRIGGERINPUT(__INPUT__)  (((__INPUT__) == DTS_TRIGGER_HW_NONE)   || \
                                         ((__INPUT__) == DTS_TRIGGER_LPTIMER1)  || \
                                         ((__INPUT__) == DTS_TRIGGER_LPTIMER2)  || \
                                         ((__INPUT__) == DTS_TRIGGER_LPTIMER3)  || \
                                         ((__INPUT__) == DTS_TRIGGER_SYSCFG_EXTI13) || \
                                         ((__INPUT__) == DTS_TRIGGER_HW_NONE_CONT))

#define IS_DTS_INTERRUPTTHRESHOLD(__THRESHOLD__)  ((__THRESHOLD__) <= 0xFFFFUL)

#define IS_DTS_DIVIDER_RATIO_NUMBER(__NUMBER__) ((__NUMBER__) <= 127UL)

#define IS_DTS_SAMPLINGTIME(__CYCLE__)  (((__CYCLE__) == DTS_SMP_TIME_1_CYCLE)  || \
                                         ((__CYCLE__) == DTS_SMP_TIME_2_CYCLE)    || \
                                         ((__CYCLE__) == DTS_SMP_TIME_3_CYCLE)    || \
                                         ((__CYCLE__) == DTS_SMP_TIME_4_CYCLE)    || \
                                         ((__CYCLE__) == DTS_SMP_TIME_5_CYCLE)    || \
                                         ((__CYCLE__) == DTS_SMP_TIME_6_CYCLE)    || \
                                         ((__CYCLE__) == DTS_SMP_TIME_7_CYCLE)    || \
                                         ((__CYCLE__) == DTS_SMP_TIME_8_CYCLE)    || \
                                         ((__CYCLE__) == DTS_SMP_TIME_9_CYCLE)    || \
                                         ((__CYCLE__) == DTS_SMP_TIME_10_CYCLE)   || \
                                         ((__CYCLE__) == DTS_SMP_TIME_11_CYCLE)   || \
                                         ((__CYCLE__) == DTS_SMP_TIME_12_CYCLE)   || \
                                         ((__CYCLE__) == DTS_SMP_TIME_13_CYCLE)   || \
                                         ((__CYCLE__) == DTS_SMP_TIME_14_CYCLE)   || \
                                         ((__CYCLE__) == DTS_SMP_TIME_15_CYCLE))
/* All combinations of interrupts are allowed */
#define IS_DTS_INTERRUPTSOURCE(__SOURCE__)  ((((__SOURCE__) & ~(DTS_IT_ASYNC | DTS_IT_SYNC)) == 0U) && \
                                             (((__SOURCE__) & (DTS_IT_ASYNC | DTS_IT_SYNC)) != 0U))
/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/

/**
  * @}
  */

/**
  * @}
  */

#endif /* DTS1 */

#ifdef __cplusplus
}
#endif

#endif /* __STM32MP13xx_HAL_DTS_H */
